; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	image4 - mode
	spectrograph2 - mode
	image0 - mode
	infrared3 - mode
	spectrograph1 - mode
	groundstation0 - direction
	groundstation2 - direction
	star10 - direction
	star4 - direction
	groundstation8 - direction
	groundstation7 - direction
	star1 - direction
	groundstation3 - direction
	groundstation9 - direction
	groundstation5 - direction
	star6 - direction
	phenomenon11 - direction
	phenomenon12 - direction
	planet13 - direction
	phenomenon14 - direction
	phenomenon15 - direction
	planet16 - direction
	planet17 - direction
	phenomenon18 - direction
	planet19 - direction
	star20 - direction
	planet21 - direction
	phenomenon22 - direction
	planet23 - direction
	planet24 - direction
	phenomenon25 - direction
	planet26 - direction
	planet27 - direction
	phenomenon28 - direction
	phenomenon29 - direction
	phenomenon30 - direction
	star31 - direction
)
(:init
	(supports instrument0 image4)
	(calibration_target instrument0 star1)
	(calibration_target instrument0 groundstation8)
	(calibration_target instrument0 groundstation7)
	(supports instrument1 image4)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 groundstation7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 planet21)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph1)
	(supports instrument2 image4)
	(calibration_target instrument2 star10)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 groundstation7)
	(calibration_target instrument3 star6)
	(supports instrument4 image0)
	(calibration_target instrument4 groundstation2)
	(calibration_target instrument4 groundstation7)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 star31)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 groundstation8)
	(calibration_target instrument5 star4)
	(calibration_target instrument5 star10)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 groundstation9)
	(calibration_target instrument6 groundstation7)
	(calibration_target instrument6 groundstation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 phenomenon11)
	(supports instrument7 image0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 groundstation3)
	(supports instrument8 spectrograph1)
	(supports instrument8 infrared3)
	(calibration_target instrument8 star1)
	(calibration_target instrument8 groundstation5)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 star31)
	(supports instrument9 infrared3)
	(calibration_target instrument9 groundstation9)
	(calibration_target instrument9 groundstation3)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 groundstation5)
	(supports instrument11 spectrograph1)
	(calibration_target instrument11 star6)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 phenomenon29)
)
(:goal (and
	(pointing satellite3 star6)
	(pointing satellite4 phenomenon18)
	(have_image phenomenon11 spectrograph1)
	(have_image phenomenon12 infrared3)
	(have_image planet13 image0)
	(have_image phenomenon14 image0)
	(have_image phenomenon15 spectrograph2)
	(have_image planet16 spectrograph1)
	(have_image phenomenon18 spectrograph1)
	(have_image planet19 image0)
	(have_image star20 image4)
	(have_image planet21 image4)
	(have_image planet23 image4)
	(have_image planet24 spectrograph1)
	(have_image phenomenon25 image4)
	(have_image planet26 spectrograph2)
	(have_image planet27 spectrograph2)
	(have_image phenomenon28 image4)
	(have_image phenomenon29 spectrograph1)
	(have_image phenomenon30 image0)
	(have_image star31 spectrograph2)
))
(:metric minimize (total-time))

)

; plan
1. (turn_to satellite3 star6 star31)
   deleted: (pointing satellite3 star31)
   added: (pointing satellite3 star6)
   goals met: 1 of 21
2. (turn_to satellite4 phenomenon18 phenomenon29)
   deleted: (pointing satellite4 phenomenon29)
   added: (pointing satellite4 phenomenon18)
   goals met: 2 of 21
3. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 2 of 21
4. (turn_to satellite2 groundstation9 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 groundstation9)
   goals met: 2 of 21
5. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 21
6. (turn_to satellite1 groundstation7 star31)
   deleted: (pointing satellite1 star31)
   added: (pointing satellite1 groundstation7)
   goals met: 2 of 21
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 21
8. (turn_to satellite0 groundstation7 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 groundstation7)
   goals met: 2 of 21
9. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 2 of 21
10. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 2 of 21
11. (calibrate satellite2 instrument6 groundstation9)
   added: (calibrated instrument6)
   goals met: 2 of 21
12. (turn_to satellite2 phenomenon11 groundstation9)
   deleted: (pointing satellite2 groundstation9)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 21
13. (calibrate satellite1 instrument4 groundstation7)
   added: (calibrated instrument4)
   goals met: 2 of 21
14. (turn_to satellite1 phenomenon14 groundstation7)
   deleted: (pointing satellite1 groundstation7)
   added: (pointing satellite1 phenomenon14)
   goals met: 2 of 21
15. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 2 of 21
16. (turn_to satellite0 phenomenon25 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 phenomenon25)
   goals met: 2 of 21
17. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 2 of 21
18. (take_image satellite2 phenomenon11 instrument6 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 3 of 21
19. (turn_to satellite4 groundstation9 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 groundstation9)
   goals met: 2 of 21
20. (take_image satellite1 phenomenon14 instrument4 image0)
   added: (have_image phenomenon14 image0)
   goals met: 3 of 21
21. (take_image satellite0 phenomenon25 instrument0 image4)
   added: (have_image phenomenon25 image4)
   goals met: 4 of 21
22. (calibrate satellite4 instrument9 groundstation9)
   added: (calibrated instrument9)
   goals met: 4 of 21
23. (turn_to satellite4 phenomenon18 groundstation9)
   deleted: (pointing satellite4 groundstation9)
   added: (pointing satellite4 phenomenon18)
   goals met: 5 of 21
24. (turn_to satellite2 phenomenon15 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon15)
   goals met: 5 of 21
25. (turn_to satellite0 phenomenon28 phenomenon25)
   deleted: (pointing satellite0 phenomenon25)
   added: (pointing satellite0 phenomenon28)
   goals met: 5 of 21
26. (turn_to satellite1 phenomenon30 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon30)
   goals met: 5 of 21
27. (take_image satellite2 phenomenon15 instrument6 spectrograph2)
   added: (have_image phenomenon15 spectrograph2)
   goals met: 6 of 21
28. (turn_to satellite4 phenomenon12 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 phenomenon12)
   goals met: 5 of 21
29. (take_image satellite0 phenomenon28 instrument0 image4)
   added: (have_image phenomenon28 image4)
   goals met: 6 of 21
30. (take_image satellite1 phenomenon30 instrument4 image0)
   added: (have_image phenomenon30 image0)
   goals met: 7 of 21
31. (take_image satellite4 phenomenon12 instrument9 infrared3)
   added: (have_image phenomenon12 infrared3)
   goals met: 8 of 21
32. (turn_to satellite2 phenomenon18 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon18)
   goals met: 8 of 21
33. (turn_to satellite1 planet13 phenomenon30)
   deleted: (pointing satellite1 phenomenon30)
   added: (pointing satellite1 planet13)
   goals met: 8 of 21
34. (turn_to satellite0 planet21 phenomenon28)
   deleted: (pointing satellite0 phenomenon28)
   added: (pointing satellite0 planet21)
   goals met: 8 of 21
35. (turn_to satellite4 phenomenon18 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon18)
   goals met: 9 of 21
36. (take_image satellite2 phenomenon18 instrument6 spectrograph1)
   added: (have_image phenomenon18 spectrograph1)
   goals met: 10 of 21
37. (take_image satellite1 planet13 instrument4 image0)
   added: (have_image planet13 image0)
   goals met: 11 of 21
38. (take_image satellite0 planet21 instrument0 image4)
   added: (have_image planet21 image4)
   goals met: 12 of 21
39. (turn_to satellite2 phenomenon29 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 phenomenon29)
   goals met: 12 of 21
40. (turn_to satellite1 planet19 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet19)
   goals met: 12 of 21
41. (turn_to satellite0 planet23 planet21)
   deleted: (pointing satellite0 planet21)
   added: (pointing satellite0 planet23)
   goals met: 12 of 21
42. (take_image satellite2 phenomenon29 instrument6 spectrograph1)
   added: (have_image phenomenon29 spectrograph1)
   goals met: 13 of 21
43. (take_image satellite1 planet19 instrument4 image0)
   added: (have_image planet19 image0)
   goals met: 14 of 21
44. (take_image satellite0 planet23 instrument0 image4)
   added: (have_image planet23 image4)
   goals met: 15 of 21
45. (turn_to satellite2 planet16 phenomenon29)
   deleted: (pointing satellite2 phenomenon29)
   added: (pointing satellite2 planet16)
   goals met: 15 of 21
46. (turn_to satellite0 star20 planet23)
   deleted: (pointing satellite0 planet23)
   added: (pointing satellite0 star20)
   goals met: 15 of 21
47. (take_image satellite2 planet16 instrument6 spectrograph1)
   added: (have_image planet16 spectrograph1)
   goals met: 16 of 21
48. (take_image satellite0 star20 instrument0 image4)
   added: (have_image star20 image4)
   goals met: 17 of 21
49. (turn_to satellite2 planet27 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 planet27)
   goals met: 17 of 21
50. (take_image satellite2 planet27 instrument6 spectrograph2)
   added: (have_image planet27 spectrograph2)
   goals met: 18 of 21
51. (turn_to satellite2 planet24 planet27)
   deleted: (pointing satellite2 planet27)
   added: (pointing satellite2 planet24)
   goals met: 18 of 21
52. (take_image satellite2 planet24 instrument6 spectrograph1)
   added: (have_image planet24 spectrograph1)
   goals met: 19 of 21
53. (turn_to satellite2 star31 planet24)
   deleted: (pointing satellite2 planet24)
   added: (pointing satellite2 star31)
   goals met: 19 of 21
54. (take_image satellite2 star31 instrument6 spectrograph2)
   added: (have_image star31 spectrograph2)
   goals met: 20 of 21
55. (turn_to satellite2 planet26 star31)
   deleted: (pointing satellite2 star31)
   added: (pointing satellite2 planet26)
   goals met: 20 of 21
56. (take_image satellite2 planet26 instrument6 spectrograph2)
   added: (have_image planet26 spectrograph2)
   goals met: 21 of 21
